# Создание словарей:
A=dict(zip([1,2,3],['K','L','M']))
B=dict.fromkeys([10,20,30],'Z')
# Отображение результата:
print("A =",A)
print("B =",B)
# Сравнение словарей:
print("Сравнение словарей:")
print("A==B:",A==B)
print("A!=B:",A!=B)
# Добавление одного словаря к другому:
A.update(B)
# Проверка результата:
print("Объединение словарей:")
print("A =",A)
# Проверка содержимого словаря:
print("Проверка содержимого словаря:")
print((20,'Z') in A.items())
print(20 in A)
print('Z' in A)
print(5 not in A)
# Очистка словаря:
A.clear()
# Проверка результата:
print("Словарь после очистки:")
print("A =",A)
